'use strict';

// Вам дан список ip-адресов -> IPv4
// задача: написать функцию, которая будет возвращать число равное
// количеству уникальных ip - адресов

const countUniqueIPs = (ipList) => {
  const uniqueIPs = new Set(ipList);
  return uniqueIPs.size;
}

const listIPv4 = [
  "10.90.112.24",
  "10.64.146.250",
  "10.215.63.84",
  "10.125.20.72",
  "10.143.250.143",
  "10.181.137.59",
  "10.228.172.128",
  "10.111.75.25",
  "10.248.130.41",
  "10.61.119.18",
  "10.214.91.201",
  "10.135.242.153",
  "10.25.124.143",
  "10.150.137.9",
  "10.188.194.209",
  "10.20.86.137",
  "10.177.18.221",
  "10.155.176.121",
  "10.118.134.95",
  "10.220.244.27",
  "10.137.120.195",
  "10.254.90.68",
  "10.241.123.192",
];

const uniqueIPCount = countUniqueIPs(listIPv4);
console.log(`Количество уникальных IPv4: ${uniqueIPCount}`); // Покажет 23 уникальных IPv4 
